# a = '12.0'
# float(a)
#
# is_nice =False
# state = "nice" if is_nice else "not_nice"
# print(state)



# ------------------- Циклы ----------------------- #
# - повторение действий
# while,  for

#----------------while -----------------------#
# while условие:
#   инструкции

# n = 10 # кол-во грязных тарелок
# while n != 0:
#     print("Берем грязную тарелку")
#     print("Моем грязную тарелку")
#     n -= 1 # n = n - 1
#     print(f"осталось грязных тарелок = {n}")
#     print("Ставим чистую тарелку сушиться", end = '\n ------------------------------- \n')

# # ------------------------ЗАДАЧА------------------------------#
# # Квадрат при помощи черепахи
#
# from turtle import *
# side = 0 # ни одна сторона еще не нарисована
# shape('turtle')
# while side < 4:# Черепаха должна остановиться когда нарисует 4 стороны
#     forward(100)
#     left(90)
#     stamp()# создает копию фигуры и  оставляет на окне
#     side += 1 #нарисовала и потом посчитала
#     print(f'Нарисовала {side} сторон')
#     import time
#     time.sleep(1)


#
# # ------------------------ЗАДАЧА------------------------------#
# # file spider.gif (черепха должна нарисовать снежинку)
#
# from time import *
# from turtle import *
# side = 0
# while side != 12:
#     forward(100)
#     stamp()
#     backward(100)
#     left(360//12) # 30
#     side += 1
#     sleep(1)
#     print(f'Нарисовала {side} сторон')



# # ------------------------ЗАДАЧА------------------------------#
# # игра Угадай число.
# # Компьютер загадывает целое число (1 до 100).
# # Задача пользователя отгадать число
#
# # Алгоритм
# # 1.Компьютер загадывает число.
# # Пользователь вводит свой ответ
# # Сравниваем число_пользователя == число_компьютера
#
# # сделаем рандомное число
# import random # подключаем модуль - файл, в котором написаны функции
#
# # решение
# computer_number = random.randint(1, 100)# Компьютер загадывает целое число [1 до 100].
# user_number = 0 # пользователь еще не выбрал
# while user_number != computer_number:
#     user_number = int(input("your number: "))
#     if user_number == computer_number:
#         print("YOU WIN !!!")
#     else: print("не угадали", end='\n ---------------------\n')





# # ------------------------ЗАДАЧА------------------------------#
# # file flower.gif  Цветочок (6 окружностей нарисованных по кругу )
#
# from turtle import *
# import time
#
# count = 6
# while count != 0:
#     circle(100) # 100 - r
#     left(360//6)
#     count -= 1
#     print(f"Осталось нарисовать {count} кругов")
#     time.sleep(1)



# # ------------------------ЗАДАЧА------------------------------#
# # file butterfly.gif
# # Бабочка
# # (20+ окружностей нарисованных из точки с увеличенным радиусом )
#
#
# from turtle import *
# from time import *
#
# left(90)
# r = 20
# steps = 20
# while steps != 0:
#     circle(r)
#     circle(-r)
#     r += 5
#     steps -= 1
#
# sleep(1)


# # ------------------------ЗАДАЧА------------------------------#
# напечатать числа от start до end включительно #
# start = 10
# end = 15
# 10, 11, 12 ,13, 14, 15 (можно на разных строках)

start = 1
end = 100
end_str = ', '
while start <= end:
    if start == end:
        end_str = ''
    print(start, end=end_str)
    start += 1