# # -------------------------------------- Задание -----------------------------------------  #
# # Выведите на экран строки вида:
# # *******
# # ****
# # *******
# # ****
# # *******
# # ****
# # (всего n строк, звездочек или 7, или 4 по очереди)
# strings = 7 # как-то получили значение
# string_1 = 4 # в первой строке кол-во звездочек 7 или 4
#
# while strings != 0:
#     strings -= 1
#     if string_1 == 7:
#         string_1 = 4
#         print("*******")
#     elif string_1 == 4:
#         string_1 = 7
#         print("****")
#     else:
#         print("неправльное значение")
#
#
# # -------------------------------------- Второй способ -----------------------------------------  #
# # Выведите на экран строки вида:
# # *******
# # ****
# # *******
# # ****
# # *******
# # ****
# # (всего n строк, звездочек или 7, или 4 по очереди)
# strings = 7 # как-то получили значение
# string_1 = 4 # в первой строке кол-во звездочек 7 или 4
#
#
# while strings != 0:
#     if strings % 2 != 0 and string_1 == 7:
#         print(f"{strings} *******")
#     elif strings % 2 == 0 and string_1 == 7:
#         print(f"{strings} ****")
#     elif strings % 2 != 0 and string_1 == 4:
#         print(f"{strings} ****")
#     elif strings % 2 == 0 and string_1 == 4:
#         print(f"{strings} *******")
#     else:
#         print("неправльное значение")
#     strings -= 1

#
# # -------------------------------------- Третий способ -----------------------------------------  #
#
# x = 7
# k_1 = "****"
# k_2 = "*******"
# while x != 0:
#     x -= 1
#     if x % 2 != 0:
#         print(k_1)
#     else:
#         print(k_2)
#
#


# # Дано n строк
# # пользователь опредляет символ для первый строки
# # пользователь опредляет символ для второй строки
# # пользователь опредляет символ для третий строки
# # надо повторить эти символы пока даны n строк
#
#
# # n = 7
# # 1 строка = *
# # 2 строка = $
# # 3 строка = &
# # вывод
# # 1 ****
# # 2 $$$$
# # 3 &&&&
# # 4 ****
# # 5 $$$$
# # 6 &&&&
# # 7 ****
# n = int(input("Введите количество строк "))
# string1 = "****"
# string2 = "$$$$"
# string3 = u"\U0001F355"
# s = 1
#
# while n > 0:
#     if s % 3 == 0:
#         print(string3)
#     elif s % 3 == 2:
#         print(string2)
#     else:
#         print(string1)
#     s += 1
#     n -= 1




# цикл for
#-------------------for-------------------------#
# for - перебор чего-то

# for куда_записывать in где_перебираем:
#   Инструкции


# print("--------------------------------")
#
# for color in 'red', 'blue', 'black':
#     print(color)
#
# print("--------------------------------")
#
#
# for num in 1, 5, -1:
#     print(num)
#
# print("--------------------------------")
#
# for variable in 3, "smth string", 1.00:
#     print(variable)

#
# #-------------------- Задание --------------------#
# # нужно напечатать с 5 до 5000
# start = 5
# end = 5000
# for element in range(start, end+1):
#     print(element)


# диапазон - range(start=0, end, step=1) end - обязательный

# d = range(100) # d - диапазон
# print(d)# range(0, 100) - 0, 1, 2, 3 ... 99
#
# for element in d:
#     print(element)


#print("--------------------------------")
# start = 5
# end = 10
# d = range(start, end) # d - диапазон
# print(d)# range(0, 100) - 5, 6 ... 9
#
# for element in d:
#     print(element)


#print("--------------------------------")
# start = 4
# end = 10
# step = 3
# d = range(start, end+1, step) # d - диапазон
# print(d)# range(4, 11, 3) - 4, 7, 10
#
# for element in d:
#     print(element)



#----------------- Задание ------------------#
# Выведите  на экран строки (в последней строке n звездочек):
# *
# **
# ***
# ****
# *****
#
# # print("*" + "5")# конкатенация
# # print("*" * 5)# дублирование
#
# n = 3
# for count_stars in range(1, n+1):# 1, 2, 3 ... 9 при n = 10
#     print('*'*count_stars)


# #----------------- Задание ------------------#
# # дано число (любое число)
# # показать столбик с умножением на это число от 2 до 9
# n = int(input("Введите число "))
# for i in range(2, 10):
#     print(f"{n} умножить на {i} равно {n*i}")


# #----------------Задача-------------------#
# # задача cvet_krugi.jpg
# from turtle import *
# from time import*
#
#
# for count in range(4):#повторить 4 раза
#     for col in "red", "green", "blue":
#         color(col)
#         circle(100)
#         left(360/12)

# # ----------------Задача-------------------#
# # файл - задание черепешка 4.gif
#
#
# from turtle import *
# pensize(2)
# speed(15)
# for i in range(4):
#     color('blue')
#     forward(50)
#     color('red')
#     forward(50)
#     left(90)
# exitonclick()



# # ----------------Задача-------------------#
# # Дано n строк
# # пользователь опредляет символ для первый строки
# # пользователь опредляет символ для второй строки
# # пользователь опредляет символ для третий строки
# # надо повторить эти символы пока даны n строк
#
#
# # n = 7
# # 1 строка = *
# # 2 строка = $
# # 3 строка = &
# # вывод
# # 1 ****
# # 2 $$$$
# # 3 &&&&
# # 4 ****
# # 5 $$$$
# # 6 &&&&
# # 7 ****
#
# strings = 6 # кол-во строк всего
# string1 = "****"
# string2 = "$$$$"
# string3 = u"\U0001F355"
# for count in range(0, strings, 3): # count - сколько строк уже напечатно
#     if strings - count > 2:# печатаем все 3 строки
#         print(string1, string2, string3, sep="\n")
#     elif strings - count == 1: # осталось распечать 1 строку?
#         print(string1)
#     elif strings - count == 2:# осталось распечать 2 строки?
#         print(string1, string2,  sep="\n")







# # ----------------------- Задание ---------------------- #
# # распечатайте все четные числа от start до end(включительно)
# start = 1000000000
# end = 1
# if start <= end:
#     for n in range(start, end+1):
#         if n%2 == 0:
#             print(n)
# else:
#     if end % 2 != 0: #так лучше
#         end += 1
#     for n in range(end, start+1, 2): # потому что перебираем числа в два раза меньше
#         print(n)


